[
  {
    "id": "news-1",
    "title": "San Francisco Tourism Rebounds to Pre-Pandemic Levels",
    "excerpt": "San Francisco officials reported record visitor numbers this week as major attractions reopened and cultural events returned to the city.",
    "content": "San Francisco officials reported record visitor numbers this week as major attractions reopened and cultural events returned to the city.\n\nThe tourism industry, which was severely impacted during the pandemic, has shown remarkable resilience with visitor numbers now matching and in some cases exceeding 2019 levels.\n\n\"We're thrilled to see our beloved city welcoming travelers from around the world again,\" said Mayor London Breed. \"The return of tourism is not just about economic recovery—it's about the cultural exchange and vibrancy that makes San Francisco special.\"\n\nKey attractions including Alcatraz Island, the Golden Gate Bridge visitor centers, and Fisherman's Wharf have all reported increased foot traffic. Hotel occupancy rates have climbed to 85%, a significant improvement from the 30% lows seen during lockdowns.\n\nLocal businesses, particularly those in hospitality and retail, are experiencing a much-needed boost. Restaurant reservations are up 120% compared to last year, and tour operators are reporting full bookings weeks in advance.\n\nSafety measures remain in place across tourist districts, with enhanced security and emergency response systems now active in high-traffic areas. The city has also invested in improved wayfinding signage and multilingual support services.\n\nLooking ahead, tourism officials are optimistic about sustained growth, with several major conferences and events scheduled for the remainder of the year.",
    "category": "Community",
    "source": "SF Chronicle",
    "author": "Sarah Chen",
    "imageUrl": "https://picsum.photos/800/400?random=60",
    "publishedAt": "2025-10-12T14:30:00Z",
    "sentiment": 1,
    "biasScore": 25,
    "tags": ["tourism", "economy", "recovery", "local-business"],
    "views": 8932,
    "saves": 342,
    "shares": 128,
    "flags": 0,
    "url": "https://example.com/news/tourism-rebounds",
    "isVerified": true,
    "createdAt": "2025-10-12T14:30:00Z",
    "updatedAt": "2025-10-12T14:30:00Z"
  },
  {
    "id": "news-2",
    "title": "New Safety Initiative Reduces Crime in Tenderloin by 18%",
    "excerpt": "A comprehensive safety program combining increased police presence, community outreach, and social services shows promising results.",
    "content": "A comprehensive safety initiative launched six months ago in San Francisco's Tenderloin district has resulted in an 18% reduction in reported crimes, according to data released by the SFPD today.\n\nThe multi-faceted approach combines increased police foot patrols, expanded mental health crisis response teams, and improved street lighting with community engagement programs and job training opportunities for at-risk youth.\n\n\"This isn't just about enforcement—it's about addressing root causes,\" explained Police Chief William Scott. \"We've worked closely with community organizations to create sustainable solutions that make everyone feel safer.\"\n\nThe initiative has deployed 45 additional officers for neighborhood patrols, installed 200 new LED streetlights, and established three new community resource centers offering services ranging from addiction treatment to employment assistance.\n\nResidents have reported feeling significantly safer, with a community survey showing a 32% increase in positive safety perceptions. Local business owners have also noted improvements, with several shops extending their operating hours.\n\nHowever, some advocacy groups argue more resources are needed for permanent housing solutions and mental health services. \"While these results are encouraging, we must remember that sustainable change requires long-term investment in housing and healthcare,\" said Maria Rodriguez from the Tenderloin Community Coalition.\n\nThe city plans to expand similar programs to other neighborhoods in the coming year, with a budget allocation of $12 million.",
    "category": "Safety",
    "source": "CBS Bay Area",
    "author": "Michael Torres",
    "imageUrl": "https://picsum.photos/800/400?random=61",
    "publishedAt": "2025-10-11T09:15:00Z",
    "sentiment": 1,
    "biasScore": 32,
    "tags": ["safety", "crime", "community-programs", "police"],
    "views": 12451,
    "saves": 589,
    "shares": 234,
    "flags": 2,
    "url": "https://example.com/news/tenderloin-safety",
    "isVerified": true,
    "createdAt": "2025-10-11T09:15:00Z",
    "updatedAt": "2025-10-11T09:15:00Z"
  },
  {
    "id": "news-3",
    "title": "BART Announces Extended Hours for Weekend Service",
    "excerpt": "Bay Area Rapid Transit will extend operating hours on Friday and Saturday nights starting next month.",
    "content": "Bay Area Rapid Transit (BART) announced today that it will extend service hours on Friday and Saturday nights beginning November 1st, a move applauded by nightlife advocates and late-shift workers alike.\n\nUnder the new schedule, trains will run until 2:00 AM on Friday and Saturday nights, compared to the current midnight closing time. The extension adds two hours of service during the weekend's busiest nightlife periods.\n\n\"This is a win for public safety, economic vitality, and quality of life,\" said BART General Manager Bob Powers. \"People deserve safe, reliable transportation options regardless of when they work or play.\"\n\nThe decision comes after years of advocacy from restaurant workers, healthcare employees, and entertainment district business owners who argued that earlier closing times forced many to drive or use expensive ride-sharing services.\n\nBart estimates the extended hours will serve an additional 15,000 riders weekly and generate $2.3 million in annual fare revenue. The service expansion will cost approximately $8 million per year, funded through a combination of fare revenue and regional transportation funds.\n\nAdditional security personnel will be deployed during late-night hours, and all stations will maintain full lighting and camera monitoring. BART is also partnering with local municipalities to improve last-mile connections through enhanced bus service and bike-share programs.\n\nThe pilot program will run for one year, after which BART will evaluate ridership data and community feedback to determine if the extended hours should become permanent.",
    "category": "Transportation",
    "source": "SF Examiner",
    "author": "Jennifer Lee",
    "imageUrl": "https://picsum.photos/800/400?random=62",
    "publishedAt": "2025-10-10T16:45:00Z",
    "sentiment": 1,
    "biasScore": 18,
    "tags": ["transportation", "bart", "public-transit", "nightlife"],
    "views": 9234,
    "saves": 412,
    "shares": 187,
    "flags": 0,
    "url": "https://example.com/news/bart-extended-hours",
    "isVerified": true,
    "createdAt": "2025-10-10T16:45:00Z",
    "updatedAt": "2025-10-10T16:45:00Z"
  },
  {
    "id": "news-4",
    "title": "Controversial Housing Development Approved Despite Community Opposition",
    "excerpt": "City supervisors vote 8-3 to approve a 25-story residential tower in the Richmond District, sparking heated debate.",
    "content": "In a contentious 8-3 vote, San Francisco's Board of Supervisors approved a controversial 25-story residential development in the Richmond District yesterday, overriding objections from neighborhood groups concerned about building height and neighborhood character.\n\nThe project, proposed by Skyline Residential Group, will add 380 housing units—including 95 affordable units—to the corner of Geary Boulevard and 20th Avenue. The 280-foot tower exceeds the neighborhood's typical four-story height limit, which required a variance approval.\n\nSupporters argue the project addresses the city's critical housing shortage. \"We need housing of all kinds, and this project delivers both market-rate and affordable units in a transit-accessible location,\" said Supervisor Connie Chan, who voted in favor.\n\nHowever, the Richmond District Neighborhood Association organized fierce opposition, collecting over 2,000 signatures on a petition against the project. \"This massive tower is completely out of scale with our neighborhood,\" said association president Tom Walsh. \"It sets a dangerous precedent and will fundamentally change the character of our community.\"\n\nConcerns also centered on increased traffic, parking scarcity, and potential strain on local schools and services. The developer has committed to funding traffic calming measures and contributing $3 million to the school district.\n\nEnvironmental review concluded that the project would have less-than-significant impacts with mitigation measures, though critics dispute these findings.\n\nConstruction is expected to begin in spring 2026, with completion targeted for late 2028. The developer must still obtain building permits and finalize financing before breaking ground.",
    "category": "Community",
    "source": "San Francisco Magazine",
    "author": "David Kim",
    "imageUrl": "https://picsum.photos/800/400?random=63",
    "publishedAt": "2025-10-09T18:20:00Z",
    "sentiment": 0,
    "biasScore": 48,
    "tags": ["housing", "development", "controversy", "neighborhood"],
    "views": 15672,
    "saves": 723,
    "shares": 412,
    "flags": 8,
    "url": "https://example.com/news/richmond-housing-approved",
    "isVerified": true,
    "createdAt": "2025-10-09T18:20:00Z",
    "updatedAt": "2025-10-09T18:20:00Z"
  },
  {
    "id": "news-5",
    "title": "Golden Gate Park to Host Free Concert Series This Fall",
    "excerpt": "The beloved Hardly Strictly Bluegrass festival returns along with new weekly performances through November.",
    "content": "Golden Gate Park will once again be filled with music this fall as the city announces the return of the Hardly Strictly Bluegrass festival and a new weekly concert series running through November.\n\nThe free festival, which draws hundreds of thousands of music lovers annually, will take place October 20-22 with performances from over 70 artists across multiple stages. This year's lineup includes folk legend Emmylou Harris, indie favorite Phoebe Bridgers, and bluegrass virtuoso Billy Strings.\n\n\"Hardly Strictly Bluegrass exemplifies San Francisco's commitment to accessible arts and culture,\" said Recreation and Parks Director Phil Ginsburg. \"Everyone is welcome, and no ticket is required—it's a true celebration of community.\"\n\nIn addition to the main festival, the new \"Sundays in the Park\" series will feature local and regional acts performing every Sunday afternoon from September through November at the Hellman Hollow stage. Genres will range from jazz and soul to rock and world music.\n\nThe concerts are made possible through a partnership between SF Recreation and Parks, the San Francisco Arts Commission, and private donors. All events are family-friendly, and attendees are encouraged to bring picnic blankets and food.\n\nPark visitors are reminded to use public transportation when possible, as parking is limited. MUNI will add extra buses on festival days, and the park's JFK Drive remains car-free on Sundays.\n\nFood vendors and local artisans will also be on-site, offering everything from organic snacks to handmade crafts. The city emphasizes Leave No Trace principles and provides ample recycling and composting stations.\n\nFor a complete schedule and artist information, visit the Golden Gate Park events website.",
    "category": "Events",
    "source": "SF Weekly",
    "author": "Amanda Martinez",
    "imageUrl": "https://picsum.photos/800/400?random=64",
    "publishedAt": "2025-10-08T11:30:00Z",
    "sentiment": 1,
    "biasScore": 15,
    "tags": ["events", "music", "golden-gate-park", "free-events"],
    "views": 7821,
    "saves": 298,
    "shares": 156,
    "flags": 0,
    "url": "https://example.com/news/park-concerts",
    "isVerified": true,
    "createdAt": "2025-10-08T11:30:00Z",
    "updatedAt": "2025-10-08T11:30:00Z"
  }
]
